final_project/test_cases/trial_error/testcase2_2/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    minX
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }

    maxX
    {
        type            zeroGradient;
    }
    minY
    {
        type            zeroGradient;
    }
    maxY
    {
        type            zeroGradient;
    }
    minZ
    {
        type            zeroGradient;
    }
    maxZ
    {
        type            zeroGradient;
    }

    stlSurface
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

}

// ************************************************************************* //
