final_project/test_cases/trial_error/testcase2_2/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    minX
    {
 type            zeroGradient;
    }

    maxX
    {
                type            fixedValue;
        value           uniform 0;
    }
    minY
    {
               type            fixedValue;
        value           uniform 0;
    }
    maxY
    {
                type            fixedValue;
        value           uniform 0;
    }
    minZ
    {
                type            fixedValue;
        value           uniform 0;
    }
    maxZ
    {
                type            fixedValue;
        value           uniform 0;
    }

    stlSurface
    {
type            zeroGradient;
    }
}

// ************************************************************************* //
